Revit 2026 API

# ViewIsCallout Property

---

Indicates if the view is a callout view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCallout { get; }
```
```vb
Public ReadOnly Property IsCallout As Boolean
	Get
```
```cpp
public:
property bool IsCallout {
	bool get ();
}
```
```fsharp
member IsCallout : bool with get
```

#### Property Value

Boolean

Reference callouts are not treated as callout views. The view was created as a callout in its parent view but it may show as a section in orthogonal views.

#### Reference

View Class

Autodesk.Revit.DB Namespace